Revit 2027 API
ViewFamilyType.DefaultTemplateId Property
 The default template id assigned to this view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DefaultTemplateId { get; set; }
Public Property DefaultTemplateId As ElementId
	Get
	Set
public:
property ElementId^ DefaultTemplateId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DefaultTemplateId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: val is not valid as a default template id.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This value will be the view template for all newly created instances of this view type.
See Also
Reference
ViewFamilyType Class
Autodesk.Revit.DB Namespace